# non-salient pole synchronous generator 隐极同步发电机
# 电磁计算输入数据

SN = 320  # 额定容量/kVA
UN = 400  # 额定电压/V
cosphi = 0.8
f = 50
nN = 600  # 额定转速 r/min
m = 3  # 相数

D1 = 700  # 定子外径/mm
Di1 = 530 # 定子内径/mm
δ = 1.4     # 单边气隙
Di2 = 180  # 转子内径
Lt = 480   # 铁芯总长
nk = 6      # 通风道数
bk = 10     # 通风道宽
KFe = 0.96

Z2 = 90     # 转子虚槽数
Z2p = 60    # 转子实槽数
Z1 = 120  # 定子槽数
y1 = 10   # 绕组节距
a = 10    # 并联支路数
Ns = 9 + 8  # 每槽导体数
Nt = 6    # 并绕根数
d = 1.4   # 裸导线直径/mm
dc = 1.479 # 导线直径/mm

S = 3.7  # 槽口宽
B = 6.7
B1 = 8.7
H = 1.07 # 槽口深
T = 42